In [1]:
import numpy as np
import pandas as pd

In [26]:
data = pd.DataFrame({
    "name" : ["kriss", "moris", "hlo", "jhon", "mohan"],
    "age" : [21, 22, 32, 12, 23],
    "fvrt_color" : ["aa", "blue", "red", "green", "green"]
})

In [27]:
data

    name  age fvrt_color
0  kriss   21         aa
1  moris   22       blue
2    hlo   32        red
3   jhon   12      green
4  mohan   23      green

In [28]:
data["fvrt_color"].value_counts()

fvrt_color
green    2
aa       1
blue     1
red      1
Name: count, dtype: int64

In [29]:
# 1) Label Encoder

In [30]:
data

    name  age fvrt_color
0  kriss   21         aa
1  moris   22       blue
2    hlo   32        red
3   jhon   12      green
4  mohan   23      green

In [31]:
from sklearn.preprocessing import LabelEncoder

In [32]:
lblenc = LabelEncoder()

In [33]:
encoded_coloumn = lblenc.fit_transform(data["fvrt_color"])

In [34]:
encoded_coloumn

array([0, 1, 3, 2, 2])

In [35]:
data["fvrt_colorr"] = encoded_coloumn

In [36]:
data

    name  age fvrt_color  fvrt_colorr
0  kriss   21         aa            0
1  moris   22       blue            1
2    hlo   32        red            3
3   jhon   12      green            2
4  mohan   23      green            2

In [37]:
# 2) one-hot encoding ---binary

data = pd.DataFrame({
    "name" : ["kriss", "moris", "hlo", "jhon", "mohan"],
    "age" : [21, 22, 32, 12, 23],
    "fvrt_color" : ["red", "blue", "red", "green", "green"]
})

In [38]:
data["fvrt_color"].value_counts()

fvrt_color
red      2
green    2
blue     1
Name: count, dtype: int64

In [63]:
from sklearn.preprocessing import OneHotEncoder

In [64]:
ohe = OneHotEncoder(sparse_output=False)

In [65]:
dta = ohe.fit_transform(data[["fvrt_color"]])

In [66]:
dta

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.]])

In [73]:
data["blue"] = dta[:, 0]
data["green"] = dta[:, 1]
data["red"] = dta[:, 2]

In [74]:
data

    name  age fvrt_color  red  green  blue
0  kriss   21        red  1.0    0.0   0.0
1  moris   22       blue  0.0    0.0   1.0
2    hlo   32        red  1.0    0.0   0.0
3   jhon   12      green  0.0    1.0   0.0
4  mohan   23      green  0.0    1.0   0.0

In [76]:
# pandas ---> get_dummies()

In [77]:
# 2) one-hot encoding ---binary

data = pd.DataFrame({
    "name" : ["kriss", "moris", "hlo", "jhon", "mohan"],
    "age" : [21, 22, 32, 12, 23],
    "fvrt_color" : ["red", "blue", "red", "green", "green"]
})

In [90]:
data_nw = pd.get_dummies(data["fvrt_color"], dtype = "int")

In [91]:
data.join(data_nw)

    name  age fvrt_color  blue  green  red
0  kriss   21        red     0      0    1
1  moris   22       blue     1      0    0
2    hlo   32        red     0      0    1
3   jhon   12      green     0      1    0
4  mohan   23      green     0      1    0

In [92]:
label encoder
one hot encoder
get_dummies



10)

SyntaxError: invalid syntax (2034929454.py, line 1)

In [93]:
# odinal encoder

In [96]:
# 2) one-hot encoding ---binary

data = pd.DataFrame({
    "name" : ["kriss", "moris", "hlo", "jhon", "mohan"],
    "age" : [21, 22, 32, 12, 23],
    "fvrt_color" : ["red", "blue", "red", "green", "green"]
})

In [101]:
from sklearn.preprocessing import OrdinalEncoder

In [103]:
oe = OrdinalEncoder(categories = [["green", "blue", "red"]])

In [105]:
xy = oe.fit_transform(data[["fvrt_color"]])

In [106]:
data["new"] = xy

In [107]:
data

    name  age fvrt_color  new
0  kriss   21        red  2.0
1  moris   22       blue  1.0
2    hlo   32        red  2.0
3   jhon   12      green  0.0
4  mohan   23      green  0.0